RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/n32_drivers/drv_pwm.c

 /*
 * Copyright (c) 2006-2030, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       						Notes
 * 2026-03-09     Car12(1085582540@qq.com)       	first version
 * 2026-04-28     Car12(1085582540@qq.com)       	1.tim1,tim5 pwm output bug;
 * 													2.N32L406 N32G457 add all time Kconfig config
 * 													
 */
#include <rtthread.h>
#ifdef BSP_USING_PWM

#define DBG_TAG "PWM"
#define DBG_LEVEL LOG_LVL_WARNING
#include <rtdbg.h>
#include <board.h>
#include <drivers\dev_pwm.h>
#define MAX_PERIOD 0xffff
#define MIN_PERIOD 1
#define MIN_PULSE 1
/*chanel ID*/
enum N32_PWM_CH
{
	N32_PWM_CH_1 = 1,
	N32_PWM_CH_2,
	N32_PWM_CH_3,
	N32_PWM_CH_4
};
struct n32_pwm_channel
{
    GPIO_Module *gpio_grp; /* gpio*/ 
    uint16_t pin;          /*gpio pin*/  
    uint16_t pwm_mode;     /*pwm mode*/ 
#if defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
    uint32_t gpio_af; /*gpio afio*/ 
#endif
    char *info;/**chanel info*/
};
struct n32_pwm
{
    struct rt_device_pwm pwm_device; /*pwm obj*/ 
    TIM_Module *tim;                 /*timers*/ 
    struct n32_pwm_channel ch[4];    /*chanel*/ 
    uint32_t prescaler;              /*pre*/ 
#if defined(SOC_N32G45X) || defined(SOC_N32WB452) || defined(SOC_N32G4FR)
    uint32_t gpio_af; /*afio*/ 
#endif
    char *name; /*driver name*/ 
};

/**
 * @brief new timer object
 */
static struct n32_pwm n32_pwm_obj[] =
    {
#if defined(SOC_N32G45X) || defined(SOC_N32WB452) || defined(SOC_N32G4FR)
#ifdef BSP_USING_TIM1_PWM
        {
            .tim = TIM1,
            .name = "pwm1",
#ifdef TIM1_REMAP_0
            .gpio_af = 0,
#ifdef BSP_USING_TIM1_PWM_CH0
            .ch[0].gpio_grp = GPIOA,
            .ch[0].pin = GPIO_PIN_8,
            .ch[0].pwm_mode = TIM_OCMODE_PWM1,
            .ch[0].info = "TIM1 PWMCH0 PA8",
#endif /* BSP_USING_TIM1_PWM_CH0 */
#ifdef BSP_USING_TIM1_PWM_CH1
            .ch[1].gpio_grp = GPIOA,
            .ch[1].pin = GPIO_PIN_9,
            .ch[1].pwm_mode = TIM_OCMODE_PWM1,
            .ch[1].info = "TIM1 PWMCH1 PA9",
#endif /* BSP_USING_TIM1_PWM_CH1 */
#ifdef BSP_USING_TIM1_PWM_CH2
            .ch[2].gpio_grp = GPIOA,
            .ch[2].pin = GPIO_PIN_10,
            .ch[2].pwm_mode = TIM_OCMODE_PWM1,
            .ch[2].info = "TIM1 PWMCH2 PA10",
#endif /* BSP_USING_TIM1_PWM_CH2 */
#ifdef BSP_USING_TIM1_PWM_CH3
            .ch[3].gpio_grp = GPIOA,
            .ch[3].pin = GPIO_PIN_11,
            .ch[3].pwm_mode = TIM_OCMODE_PWM1,
            .ch[3].info = "TIM1 PWMCH3 PA11",
#endif /* BSP_USING_TIM1_PWM_CH3 */
#endif /*TIM1_REMAP_0*/
#ifdef TIM1_REMAP_3
            .gpio_af = GPIO_ALL_RMP_TIM1,
#ifdef BSP_USING_TIM1_PWM_CH0
            .ch[0].gpio_grp = GPIOE,
            .ch[0].pin = GPIO_PIN_9,
            .ch[0].pwm_mode = TIM_OCMODE_PWM1,
            .ch[0].info = "TIM1 PWMCH0 PE9",
#endif /* BSP_USING_TIM1_PWM_CH0 */
#ifdef BSP_USING_TIM1_PWM_CH1
            .ch[1].gpio_grp = GPIOE,
            .ch[1].pin = GPIO_PIN_11,
            .ch[1].pwm_mode = TIM_OCMODE_PWM1,
            .ch[1].info = "TIM1 PWMCH1 PE11",
#endif /* BSP_USING_TIM1_PWM_CH1 */
#ifdef BSP_USING_TIM1_PWM_CH2
            .ch[2].gpio_grp = GPIOE,
            .ch[2].pin = GPIO_PIN_13,
            .ch[2].pwm_mode = TIM_OCMODE_PWM1,
            .ch[2].info = "TIM1 PWMCH2 PE13",
#endif /* BSP_USING_TIM1_PWM_CH2 */
#ifdef BSP_USING_TIM1_PWM_CH3
            .ch[3].gpio_grp = GPIOE,
            .ch[3].pin = GPIO_PIN_14,
            .ch[3].pwm_mode = TIM_OCMODE_PWM1,
            .ch[3].info = "TIM1 PWMCH3 PE14",
#endif /* BSP_USING_TIM1_PWM_CH3 */
#endif /*TIM1_REMAP_3*/
        },
#endif /*BSP_USING_TIM1_PWM*/
#ifdef BSP_USING_TIM2_PWM
        {
            .tim = TIM2,
            .name = "pwm2",
#ifdef TIM2_REMAP_0
            .gpio_af = 0,
#endif
#ifdef TIM2_REMAP_1
            .gpio_af = GPIO_PartialRemap1_TIM2,
#endif
#ifdef TIM2_REMAP_2
            .gpio_af = GPIO_PART2_RMP_TIM2,
#endif
#ifdef TIM2_REMAP_3
            .gpio_af = GPIO_ALL_RMP_TIM2,
#endif
#if defined(TIM2_REMAP_0) || defined(TIM2_REMAP_2)
#ifdef BSP_USING_TIM2_PWM_CH0
            .ch[0].gpio_grp = GPIOA,
            .ch[0].pin = GPIO_PIN_0,
            .ch[0].pwm_mode = TIM_OCMODE_PWM1,
            .ch[0].info = "TIM2 PWMCH0 PA0",
#endif /*TIM2_PWM_CFG_CH1  */
#ifdef BSP_USING_TIM2_PWM_CH1
            .ch[1].gpio_grp = GPIOA,
            .ch[1].pin = GPIO_PIN_1,
            .ch[1].pwm_mode = TIM_OCMODE_PWM1,
            .ch[1].info = "TIM2 PWMCH1 PA1",
#endif /*TIM2_PWM_CFG_CH2  */
#endif /*TIM2_REMAP_1   TIM2_REMAP_3  */
#if defined(TIM2_REMAP_1) || defined(TIM2_REMAP_3)
#ifdef BSP_USING_TIM2_PWM_CH0
            .ch[0].gpio_grp = GPIOA,
            .ch[0].pin = GPIO_PIN_15,
            .ch[0].pwm_mode = TIM_OCMODE_PWM1,
            .ch[0].info = "TIM2 PWMCH0 PA15",
#endif /*TIM2_PWM_CFG_CH1  */
#ifdef BSP_USING_TIM2_PWM_CH1
            .ch[1].gpio_grp = GPIOB,
            .ch[1].pin = GPIO_PIN_3,
            .ch[1].pwm_mode = TIM_OCMODE_PWM1,
            .ch[1].info = "TIM2 PWMCH1 PB3",
#endif /*TIM2_PWM_CFG_CH2  */
#endif /*defined(TIM2_REMAP_2) ||defined(TIM2_REMAP_4)  */
#if defined(TIM2_REMAP_0) || defined(TIM2_REMAP_1)
#ifdef BSP_USING_TIM2_PWM_CH2
            .ch[2].gpio_grp = GPIOA,
            .ch[2].pin = GPIO_PIN_2,
            .ch[2].pwm_mode = TIM_OCMODE_PWM1,
            .ch[2].info = "TIM2 PWMCH2 PA2",
#endif /*TIM2_PWM_CFG_CH2  */
#ifdef BSP_USING_TIM2_PWM_CH3
            .ch[3].gpio_grp = GPIOA,
            .ch[3].pin = GPIO_PIN_3,
            .ch[3].pwm_mode = TIM_OCMODE_PWM1,
            .ch[3].info = "TIM2 PWMCH3 PA3",
#endif /*TIM2_PWM_CFG_CH2  */
#endif /*defined(TIM2_REMAP_0) ||defined(TIM2_REMAP_1)*/
#if defined(TIM2_REMAP_2) || defined(TIM2_REMAP_3)
#ifdef BSP_USING_TIM2_PWM_CH2
            .ch[2].gpio_grp = GPIOB,
            .ch[2].pin = GPIO_PIN_10,
            .ch[2].pwm_mode = TIM_OCMODE_PWM1,
            .ch[2].info = "TIM2 PWMCH2 PB10",
#endif /*TIM2_PWM_CFG_CH2  */
#ifdef BSP_USING_TIM2_PWM_CH3
            .ch[3].gpio_grp = GPIOB,
            .ch[3].pin = GPIO_PIN_11,
            .ch[3].pwm_mode = TIM_OCMODE_PWM1,
            .ch[3].info = "TIM2 PWMCH3 PB11",
#endif /*TIM2_PWM_CFG_CH2  */
#endif /*defined(TIM2_REMAP_2) ||defined(TIM2_REMAP_3)*/
        },
#endif /*BSP_USING_TIM2_PWM*/
#ifdef BSP_USING_TIM3_PWM
        {
            .tim = TIM3,
            .name = "pwm3",
#ifdef TIM3_REMAP_0
            .gpio_af = 0,
#endif
#ifdef TIM3_REMAP_2
            .gpio_af = GPIO_PART1_RMP_TIM3,
#endif
#ifdef TIM3_REMAP_3
            .gpio_af = GPIO_ALL_RMP_TIM3,
#endif
#if defined(TIM3_REMAP_0)
#ifdef BSP_USING_TIM3_PWM_CH0
            .ch[0].gpio_grp = GPIOA,
            .ch[0].pin = GPIO_PIN_6,
            .ch[0].pwm_mode = TIM_OCMODE_PWM1,
            .ch[0].info = "TIM3 PWMCH0 PA6",
#endif /*TIM2_PWM_CFG_CH1  */
#ifdef BSP_USING_TIM3_PWM_CH1
            .ch[1].gpio_grp = GPIOA,
            .ch[1].pin = GPIO_PIN_7,
            .ch[1].pwm_mode = TIM_OCMODE_PWM1,
            .ch[1].info = "TIM3 PWMCH1 PA7",
#endif /*TIM2_PWM_CFG_CH2  */
#endif /*TIM2_REMAP_0     */
#if defined(TIM3_REMAP_2)
#ifdef BSP_USING_TIM3_PWM_CH0
            .ch[0].gpio_grp = GPIOB,
            .ch[0].pin = GPIO_PIN_4,
            .ch[0].pwm_mode = TIM_OCMODE_PWM1,
            .ch[0].info = "TIM3 PWMCH0 PB4",
#endif /*TIM2_PWM_CFG_CH1  */
#ifdef BSP_USING_TIM3_PWM_CH1
            .ch[1].gpio_grp = GPIOB,
            .ch[1].pin = GPIO_PIN_5,
            .ch[1].pwm_mode = TIM_OCMODE_PWM1,
            .ch[1].info = "TIM3 PWMCH1 PB5",
#endif /*TIM2_PWM_CFG_CH2  */
#endif /*TIM2_REMAP_2     */
#if defined(TIM3_REMAP_0) || defined(TIM3_REMAP_2)
#ifdef BSP_USING_TIM3_PWM_CH2
            .ch[2].gpio_grp = GPIOB,
            .ch[2].pin = GPIO_PIN_0,
            .ch[2].pwm_mode = TIM_OCMODE_PWM1,
            .ch[2].info = "TIM3 PWMCH2 PB0",
#endif /*BSP_USING_TIM3_PWM_CH2  */
#ifdef BSP_USING_TIM3_PWM_CH3
            .ch[3].gpio_grp = GPIOB,
            .ch[3].pin = GPIO_PIN_1,
            .ch[3].pwm_mode = TIM_OCMODE_PWM1,
            .ch[3].info = "TIM3 PWMCH3 PB1",
#endif /*BSP_USING_TIM3_PWM_CH3  */
#endif /*defined(TIM3_REMAP_0) || defined(TIM3_REMAP_2)*/
#if defined(TIM3_REMAP_3)
#ifdef BSP_USING_TIM3_PWM_CH0
            .ch[0].gpio_grp = GPIOC,
            .ch[0].pin = GPIO_PIN_6,
            .ch[0].pwm_mode = TIM_OCMODE_PWM1,
            .ch[0].info = "TIM3 PWMCH0 PC6",
#endif /*BSP_USING_TIM3_PWM_CH0  */
#ifdef BSP_USING_TIM3_PWM_CH1
            .ch[1].gpio_grp = GPIOC,
            .ch[1].pin = GPIO_PIN_7,
            .ch[1].pwm_mode = TIM_OCMODE_PWM1,
            .ch[1].info = "TIM3 PWMCH1 PC7",
#endif /*BSP_USING_TIM3_PWM_CH1  */
#ifdef BSP_USING_TIM3_PWM_CH2
            .ch[2].gpio_grp = GPIOC,
            .ch[2].pin = GPIO_PIN_8,
            .ch[2].pwm_mode = TIM_OCMODE_PWM1,
            .ch[2].info = "TIM3 PWMCH2 PC8",
#endif /*BSP_USING_TIM3_PWM_CH2  */
#ifdef BSP_USING_TIM3_PWM_CH3
            .ch[3].gpio_grp = GPIOC,
            .ch[3].pin = GPIO_PIN_9,
            .ch[3].pwm_mode = TIM_OCMODE_PWM1,
            .ch[3].info = "TIM3 PWMCH3 PC9",
#endif /*BSP_USING_TIM3_PWM_CH3  */
#endif /*defined(TIM3_REMAP_3)*/
		},
#endif /*BSP_USING_TIM3_PWM */
#ifdef BSP_USING_TIM4_PWM
		{
			.tim = TIM4,
			.name = "pwm4",
#ifdef TIM4_PB6_PB7_PB8_PB9
			.gpio_af = 0,
#endif
#ifdef TIM4_PD12_PD13_PD14_PD15
			.gpio_af = GPIO_RMP_TIM4,
#endif

