RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/n32_drivers/drv_pwm.c
#ifdef TIM4_PB6_PB7_PB8_PB9
#ifdef BSP_USING_TIM4_PWM_CH0
			.ch[0].gpio_grp = GPIOB,
			.ch[0].pin = GPIO_PIN_6,
			.ch[0].pwm_mode = TIM_OCMODE_PWM1,
			.ch[0].info = "TIM4 PWMCH0 PB6",
#endif /*TIM2_PWM_CFG_CH1  */
#ifdef BSP_USING_TIM4_PWM_CH1
			.ch[1].gpio_grp = GPIOB,
			.ch[1].pin = GPIO_PIN_7,
			.ch[1].pwm_mode = TIM_OCMODE_PWM1,
			.ch[1].info = "TIM4 PWMCH1 PB7",
#endif /*BSP_USING_TIM4_PWM_CH1  */
#ifdef BSP_USING_TIM4_PWM_CH2
			.ch[2].gpio_grp = GPIOB,
			.ch[2].pin = GPIO_PIN_8,
			.ch[2].pwm_mode = TIM_OCMODE_PWM1,
			.ch[2].info = "TIM4 PWMCH2 PB8",
#endif /*BSP_USING_TIM4_PWM_CH2  */
#ifdef BSP_USING_TIM4_PWM_CH3
			.ch[3].gpio_grp = GPIOB,
			.ch[3].pin = GPIO_PIN_9,
			.ch[3].pwm_mode = TIM_OCMODE_PWM1,
			.ch[3].info = "TIM4 PWMCH3 PB9",
#endif /*BSP_USING_TIM4_PWM_CH3  */
#endif /*TIM4_PB6_PB7_PB8_PB9*/

#ifdef TIM4_PD12_PD13_PD14_PD15
#ifdef BSP_USING_TIM4_PWM_CH0
			.ch[0].gpio_grp = GPIOD,
			.ch[0].pin = GPIO_PIN_12,
			.ch[0].pwm_mode = TIM_OCMODE_PWM1,
			.ch[0].info = "TIM4 PWMCH0 PD12",
#endif /*TIM2_PWM_CFG_CH1  */
#ifdef BSP_USING_TIM4_PWM_CH1
			.ch[1].gpio_grp = GPIOD,
			.ch[1].pin = GPIO_PIN_13,
			.ch[1].pwm_mode = TIM_OCMODE_PWM1,
			.ch[1].info = "TIM4 PWMCH1 PD13",
#endif /*BSP_USING_TIM4_PWM_CH1  */
#ifdef BSP_USING_TIM4_PWM_CH2
			.ch[2].gpio_grp = GPIOD,
			.ch[2].pin = GPIO_PIN_14,
			.ch[2].pwm_mode = TIM_OCMODE_PWM1,
			.ch[2].info = "TIM4 PWMCH2 PD14",
#endif /*BSP_USING_TIM4_PWM_CH2  */
#ifdef BSP_USING_TIM4_PWM_CH3
			.ch[3].gpio_grp = GPIOD,
			.ch[3].pin = GPIO_PIN_15,
			.ch[3].pwm_mode = TIM_OCMODE_PWM1,
			.ch[3].info = "TIM4 PWMCH3 PD15",
#endif /*BSP_USING_TIM4_PWM_CH3  */
#endif /*TIM4_PD12_PD13_PD14_PD15*/
		},
#endif /*BSP_USING_TIM4_PWM */
#ifdef BSP_USING_TIM5_PWM
		{
			.tim = TIM5,
			.name = "pwm5",
			.gpio_af = 0,
#ifdef BSP_USING_TIM5_PWM_CH0
			.ch[0].gpio_grp = GPIOA,
			.ch[0].pin = GPIO_PIN_0,
			.ch[0].pwm_mode = TIM_OCMODE_PWM1,
			.ch[0].info = "TIM5 PWMCH0 PA0",
#endif /*TIM2_PWM_CFG_CH1  */
#ifdef BSP_USING_TIM5_PWM_CH1
			.ch[1].gpio_grp = GPIOA,
			.ch[1].pin = GPIO_PIN_1,
			.ch[1].pwm_mode = TIM_OCMODE_PWM1,
			.ch[1].info = "TIM5 PWMCH1 PA1",
#endif /*BSP_USING_TIM5_PWM_CH1  */
#ifdef BSP_USING_TIM5_PWM_CH2
			.ch[2].gpio_grp = GPIOA,
			.ch[2].pin = GPIO_PIN_2,
			.ch[2].pwm_mode = TIM_OCMODE_PWM1,
			.ch[2].info = "TIM5 PWMCH2 PA2",
#endif /*BSP_USING_TIM5_PWM_CH2  */
#ifdef BSP_USING_TIM5_PWM_CH3
			.ch[3].gpio_grp = GPIOA,
			.ch[3].pin = GPIO_PIN_3,
			.ch[3].pwm_mode = TIM_OCMODE_PWM1,
			.ch[3].info = "TIM5 PWMCH3 PA3",
#endif /*BSP_USING_TIM5_PWM_CH3  */
		},
#endif /*BSP_USING_TIM5_PWM */
#ifdef BSP_USING_TIM8_PWM
		{
			.tim = TIM8,
			.name = "pwm8",
#ifdef TIM8_PC6_PC7_PC8_PC9
			.gpio_af = 0,
#endif
#ifdef TIM8_PD14_PD15_PC8_PC9
			.gpio_af = GPIO_RMP3_TIM8,
#endif

#ifdef TIM8_PC6_PC7_PC8_PC9
#ifdef BSP_USING_TIM8_PWM_CH0
			.ch[0].gpio_grp = GPIOC,
			.ch[0].pin = GPIO_PIN_6,
			.ch[0].pwm_mode = TIM_OCMODE_PWM1,
			.ch[0].info = "TIM8 PWMCH0 PC6",
#endif /*TIM2_PWM_CFG_CH1  */
#ifdef BSP_USING_TIM8_PWM_CH1
			.ch[1].gpio_grp = GPIOC,
			.ch[1].pin = GPIO_PIN_7,
			.ch[1].pwm_mode = TIM_OCMODE_PWM1,
			.ch[1].info = "TIM8 PWMCH1 PC7",
#endif /*BSP_USING_TIM8_PWM_CH1  */
#endif /*TIM8_PC6_PC7_PC8_PC9*/

#ifdef TIM8_PD14_PD15_PC8_PC9
#ifdef BSP_USING_TIM8_PWM_CH0
			.ch[0].gpio_grp = GPIOD,
			.ch[0].pin = GPIO_PIN_14,
			.ch[0].pwm_mode = TIM_OCMODE_PWM1,
			.ch[0].info = "TIM8 PWMCH0 PD14",
#endif /*TIM2_PWM_CFG_CH1  */
#ifdef BSP_USING_TIM8_PWM_CH1
			.ch[1].gpio_grp = GPIOD,
			.ch[1].pin = GPIO_PIN_15,
			.ch[1].pwm_mode = TIM_OCMODE_PWM1,
			.ch[1].info = "TIM8 PWMCH1 PD15",
#endif /*BSP_USING_TIM8_PWM_CH1  */
#endif /*TIM8_PD14_PD15_PC8_PC9*/

#ifdef BSP_USING_TIM8_PWM_CH2
			.ch[2].gpio_grp = GPIOC,
			.ch[2].pin = GPIO_PIN_8,
			.ch[2].pwm_mode = TIM_OCMODE_PWM1,
			.ch[2].info = "TIM8 PWMCH2 PC8",
#endif /*BSP_USING_TIM8_PWM_CH2  */
#ifdef BSP_USING_TIM8_PWM_CH3
			.ch[3].gpio_grp = GPIOC,
			.ch[3].pin = GPIO_PIN_9,
			.ch[3].pwm_mode = TIM_OCMODE_PWM1,
			.ch[3].info = "TIM8 PWMCH3 PC9",
#endif /*BSP_USING_TIM8_PWM_CH3  */
		},
#endif /*BSP_USING_TIM8_PWM */
#else /* defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X) START*/
#ifdef BSP_USING_TIM1_PWM 
        {
            .tim = TIM1,
            .name = "pwm1",
#ifdef BSP_USING_TIM1_PWM_CH1
            .ch[0].gpio_grp = GPIOA,
            .ch[0].pin = GPIO_PIN_8,
            .ch[0].pwm_mode = TIM_OCMODE_PWM1,
            .ch[0].info = "TIM1 PWMCH1 PA8",
            .ch[0].gpio_af = GPIO_AF2_TIM1,
#endif /* TIM1_PWM_CFG_CH1 */
#ifdef BSP_USING_TIM1_PWM_CH2
            .ch[1].gpio_grp = GPIOA,
            .ch[1].pin = GPIO_PIN_9,
            .ch[1].pwm_mode = TIM_OCMODE_PWM1,
            .ch[1].info = "TIM1 PWMCH2 PA9",
            .ch[1].gpio_af = GPIO_AF2_TIM1,
#endif /* TIM1_PWM_CFG_CH2 */
#ifdef BSP_USING_TIM1_PWM_CH3
            .ch[2].gpio_grp = GPIOA,
            .ch[2].pin = GPIO_PIN_10,
            .ch[2].pwm_mode = TIM_OCMODE_PWM1,
            .ch[2].info = "TIM1 PWMCH3 PA10",
            .ch[2].gpio_af = GPIO_AF2_TIM1,
#endif /* TIM1_PWM_CFG_CH3 */
#ifdef BSP_USING_TIM1_PWM_CH4
            .ch[3].gpio_grp = GPIOA,
            .ch[3].pin = GPIO_PIN_11,
            .ch[3].pwm_mode = TIM_OCMODE_PWM1,
            .ch[3].info = "TIM1 PWMCH4 PA11",
            .ch[3].gpio_af = GPIO_AF2_TIM1,
#endif /* TIM1_PWM_CFG_CH4 */
        },
#endif /*BSP_USING_TIM1_PWM*/
#ifdef BSP_USING_TIM2_PWM
		{
			.tim = TIM2,
			.name = "pwm2",
#ifdef BSP_USING_TIM2_PWM_CH1
#ifdef TIM2_PWM_CH1_PA0
            .ch[0].gpio_grp = GPIOA,
            .ch[0].pin = GPIO_PIN_0,
            .ch[0].info = "TIM2 PWMCH1 PA0",
            .ch[0].gpio_af = GPIO_AF2_TIM2,
#endif /* TIM2_PWM_CH1_PA0 */
#ifdef TIM2_PWM_CH1_PA15
            .ch[0].gpio_grp = GPIOA,
            .ch[0].pin = GPIO_PIN_15,
            .ch[0].info = "TIM2 PWMCH1 PA15",
            .ch[0].gpio_af = GPIO_AF5_TIM2,
#endif /* TIM2_PWM_CH1_PA15 */
            .ch[0].pwm_mode = TIM_OCMODE_PWM1,
#endif /* TIM2_PWM_CFG_CH1 */
#ifdef BSP_USING_TIM2_PWM_CH2
#ifdef TIM2_PWM_CH2_PA1
            .ch[1].gpio_grp = GPIOA,
            .ch[1].pin = GPIO_PIN_1,
            .ch[1].info = "TIM2 PWMCH2 PA1",
#endif /* TIM2_PWM_CH2_PA1 */
#ifdef TIM2_PWM_CH2_PB3
            .ch[1].gpio_grp = GPIOB,
            .ch[1].pin = GPIO_PIN_3,
            .ch[1].info = "TIM2 PWMCH2 PB3",
#endif /* TIM2_PWM_CH2_PB3 */
            .ch[1].gpio_af = GPIO_AF2_TIM2,
            .ch[1].pwm_mode = TIM_OCMODE_PWM1,
#endif /* BSP_USING_TIM2_PWM_CH2 */
#ifdef BSP_USING_TIM2_PWM_CH3
#ifdef TIM2_PWM_CH3_PA2
            .ch[2].gpio_grp = GPIOA,
            .ch[2].pin = GPIO_PIN_2,
            .ch[2].info = "TIM2 PWMCH3 PA2",
#endif /* TIM2_PWM_CH3_PA2 */
#ifdef TIM2_PWM_CH3_PB10
            .ch[2].gpio_grp = GPIOB,
            .ch[2].pin = GPIO_PIN_10,
            .ch[2].info = "TIM2 PWMCH3 PB10",
#endif /* TIM2_PWM_CH3_PB10 */
            .ch[2].pwm_mode = TIM_OCMODE_PWM1,
            .ch[2].gpio_af = GPIO_AF2_TIM2,
#endif /* TIM2_PWM_CFG_CH3 */
#ifdef BSP_USING_TIM2_PWM_CH4
            .ch[3].gpio_grp = GPIOB,
            .ch[3].pin = GPIO_PIN_11,
            .ch[3].info = "TIM2 PWMCH4 PB11",
            .ch[3].gpio_af = GPIO_AF2_TIM2,
            .ch[3].pwm_mode = TIM_OCMODE_PWM1,
#endif /* TIM2_PWM_CFG_CH4 */
        },
#endif /*BSP_USING_TIM2_PWM*/
#ifdef BSP_USING_TIM3_PWM /*BSP_USING_TIM3_PWM*/
		{
			.tim = TIM3,
			.name = "pwm3",
#ifdef BSP_USING_TIM3_PWM_CH1
#ifdef TIM3_PWM_CH1_PA6
            .ch[0].gpio_grp = GPIOA,
            .ch[0].pin = GPIO_PIN_6,
            .ch[0].info = "TIM3 PWMCH1 PA6",

