RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/n32_drivers/drv_pwm.c
    gpio_remap_JTAGOFF_SWDON(chanel->gpio_grp, chanel->pin);
    GPIO_InitStruct(&GPIO_InitStructure);
    /* pwm mode gpio cofig*/
    GPIO_InitStructure.Pin = chanel->pin;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitPeripheral(chanel->gpio_grp, &GPIO_InitStructure);
#elif defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
    RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_AFIO, ENABLE);
    GPIO_InitStruct(&GPIO_InitStructure);
    GPIO_InitStructure.Pin = chanel->pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Current = GPIO_DC_4mA;
    GPIO_InitStructure.GPIO_Alternate = chanel->gpio_af;
    GPIO_InitPeripheral(chanel->gpio_grp, &GPIO_InitStructure);
#endif
}
static void drv_pwm_oc_init(const rt_uint16_t chanel, const rt_uint16_t mode, TIM_Module *tim)
{
    OCInitType TIM_OCInitStructure;
    /*pwn chanel cofnig*/
    TIM_OCInitStructure.OcMode = mode; /*pwm mode*/ 
    TIM_OCInitStructure.OutputState = TIM_OUTPUT_STATE_ENABLE;
	TIM_OCInitStructure.Pulse = 0;
    TIM_OCInitStructure.OcPolarity = TIM_OC_POLARITY_HIGH;
	TIM_OCInitStructure.OcNPolarity = TIM_OC_POLARITY_LOW;
	TIM_OCInitStructure.OcIdleState = TIM_OC_POLARITY_HIGH;
	TIM_OCInitStructure.OcNIdleState = TIM_OC_POLARITY_LOW;
	switch (chanel)
	{
	case N32_PWM_CH_1:
		TIM_InitOc1(tim, &TIM_OCInitStructure);
		TIM_ConfigOc1Preload(tim, TIM_OC_PRE_LOAD_ENABLE);
		break;
	case N32_PWM_CH_2:
		TIM_InitOc2(tim, &TIM_OCInitStructure);
		TIM_ConfigOc2Preload(tim, TIM_OC_PRE_LOAD_ENABLE);
		break;
	case N32_PWM_CH_3:
		TIM_InitOc3(tim, &TIM_OCInitStructure);
		TIM_ConfigOc3Preload(tim, TIM_OC_PRE_LOAD_ENABLE);
		break;
	case N32_PWM_CH_4:
		TIM_InitOc4(tim, &TIM_OCInitStructure);
		TIM_ConfigOc4Preload(tim, TIM_OC_PRE_LOAD_ENABLE);
		break;
	default:
		LOG_W("pwm chanel error");
        break;
    }
}

static rt_err_t drv_n32_hw_pwm_init(struct n32_pwm *device)
{
    rt_err_t result = RT_EOK;
    TIM_TimeBaseInitType TIM_TimeBaseStructure;
    RT_ASSERT(device != RT_NULL);
    /*enable rcc*/ 
    n32_time_rcc_config(device->tim);
    /*cfg time*/ 
    TIM_TimeBaseStructure.Period = 1000; 
    TIM_TimeBaseStructure.Prescaler = device->prescaler;
    TIM_TimeBaseStructure.ClkDiv = 0;
    TIM_TimeBaseStructure.CntMode = TIM_CNT_MODE_UP;
    TIM_InitTimeBase(device->tim, &TIM_TimeBaseStructure);
#if defined(SOC_N32G45X) || defined(SOC_N32WB452) || defined(SOC_N32G4FR)

    /*gpio afio*/ 
    if (device->gpio_af)
    {
        GPIO_ConfigPinRemap(device->gpio_af, ENABLE);
    }
#endif
	RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_AFIO, ENABLE);
	/*chanel cofig*/
	for (int i = 0; i < 4; i++)
	{
		if (device->ch[i].gpio_grp)
		{
			/**gpio rcc */
			n32_gpio_rcc_enable(device->ch[i].gpio_grp);
			drv_pwm_time_gpio_config(device->ch + i);
			drv_pwm_oc_init(i + N32_PWM_CH_1, device->ch[i].pwm_mode, device->tim);
			drv_pwm_enable(device, i + N32_PWM_CH_1, RT_FALSE);
		}
	}
	/*enable timer*/
	TIM_ConfigArPreload(device->tim, ENABLE);
	TIM_Enable(device->tim, ENABLE);
	/*enable tim1 and tim8 pwm  output*/
	if (device->tim == TIM1 || device->tim == TIM8)
	{
		TIM_EnableCtrlPwmOutputs(device->tim, ENABLE);
		TIM_EnableCapCmpPreloadControl(device->tim, DISABLE); /*202604228 tim1,tim8 bug postition*/
	}
	return result;
}

static struct rt_pwm_ops drv_ops =
    {
        .control = drv_pwm_control,
};

static int drv_n32_pwm_register(void)
{
    int i = 0;
    int result = RT_EOK;
    for (i = 0; i < sizeof(n32_pwm_obj) / sizeof(n32_pwm_obj[0]); i++)
    {
        /* pwm init */
        if (drv_n32_hw_pwm_init(&n32_pwm_obj[i]) != RT_EOK)
        {
			LOG_E("%s init failed", n32_pwm_obj[i].name);
            result = -RT_ERROR;
            goto __exit;
        }
        else
        {
            /* register pwm device */
            if (rt_device_pwm_register(&n32_pwm_obj[i].pwm_device, n32_pwm_obj[i].name, &drv_ops, n32_pwm_obj + i) == RT_EOK)
            {
				LOG_D("%s register success", n32_pwm_obj[i].name);
            }
            else
            {
				LOG_E("%s register failed", n32_pwm_obj[i].name);
                result = -RT_ERROR;
            }
        }
    }
__exit:
    return result;
}
INIT_DEVICE_EXPORT(drv_n32_pwm_register);

#endif /* BSP_USING_PWM */
